ciaa/firmware_v1/externals/drivers/msp430/inc/msp430i2041.h
/* 5xx Compatibility defines */
#define SFRIE1_L            IE1       /* Interrupt Enable 1 */
#define SFRIFG1_L           IFG1      /* Interrupt Flag 1 */

#define SYSJTAGDIS_           0x01FE    /* JTAG Disable Register */
sfrw(SYSJTAGDIS, SYSJTAGDIS_);
#define JTAGDISKEY          (0xA5A5)  /* JTAG Lock Key */

/************************************************************
* CLOCK SYSTEM
************************************************************/
#define __MSP430_HAS_CS__              /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_CS__ 0x0050
#define CS_BASE __MSP430_BASEADDRESS_CS__

#define CSCTL0_               0x0050    /* CS Control Register 0 */
sfrb(CSCTL0, CSCTL0_);
#define CSCTL1_               0x0051    /* CS Control Register 1 */
sfrb(CSCTL1, CSCTL1_);
#define CSIRFCAL_             0x0052    /* CS Internal Resistor Frequency Calibration */
sfrb(CSIRFCAL, CSIRFCAL_);
#define CSIRTCAL_             0x0053    /* CS Internal Resistor Temperature Calibration */
sfrb(CSIRTCAL, CSIRTCAL_);
#define CSERFCAL_             0x0054    /* CS External Resistor Frequency Calibration */
sfrb(CSERFCAL, CSERFCAL_);
#define CSERTCAL_             0x0055    /* CS External Resistor Temperature Calibration */
sfrb(CSERTCAL, CSERTCAL_);

/* CSCTL0 Control Bits */
#define DCOR                 (0x0001)    /* DCO resistor select */
#define DCOBYP               (0x0002)    /* DCO bypass mode */
#define DCOF                 (0x0080)    /* DCO fault flag */

/* CSCTL1 Control Bits */
#define DIVM0               (0x0001)   /* MCLK Divider Bit: 0 */
#define DIVM1               (0x0002)   /* MCLK Divider Bit: 1 */
#define DIVM2               (0x0004)   /* MCLK Divider Bit: 2 */
#define DIVS0               (0x0010)   /* SMCLK Divider Bit: 0 */
#define DIVS1               (0x0020)   /* SMCLK Divider Bit: 1 */
#define DIVS2               (0x0040)   /* SMCLK Divider Bit: 2 */

#define DIVM_0              (0x0000)    /* MCLK Source Divider 0 */
#define DIVM_1              (0x0001)    /* MCLK Source Divider 1 */
#define DIVM_2              (0x0002)    /* MCLK Source Divider 2 */
#define DIVM_3              (0x0003)    /* MCLK Source Divider 3 */
#define DIVM_4              (0x0004)    /* MCLK Source Divider 5 */
#define DIVM_5              (0x0005)    /* MCLK Source Divider 6 */
#define DIVM_6              (0x0006)    /* MCLK Source Divider 7 */
#define DIVM_7              (0x0007)    /* MCLK Source Divider 8 */
#define DIVM__1             (0x0000)    /* MCLK Source Divider f(MCLK)/1 */
#define DIVM__2             (0x0001)    /* MCLK Source Divider f(MCLK)/2 */
#define DIVM__4             (0x0002)    /* MCLK Source Divider f(MCLK)/4 */
#define DIVM__8             (0x0003)    /* MCLK Source Divider f(MCLK)/8 */
#define DIVM__16            (0x0004)    /* MCLK Source Divider f(MCLK)/16 */

#define DIVS_0              (0x0000)    /* SMCLK Source Divider 0 */
#define DIVS_1              (0x0010)    /* SMCLK Source Divider 1 */
#define DIVS_2              (0x0020)    /* SMCLK Source Divider 2 */
#define DIVS_3              (0x0030)    /* SMCLK Source Divider 3 */
#define DIVS_4              (0x0040)    /* SMCLK Source Divider 5 */
#define DIVS_5              (0x0050)    /* SMCLK Source Divider 6 */
#define DIVS_6              (0x0060)    /* SMCLK Source Divider 7 */
#define DIVS_7              (0x0070)    /* SMCLK Source Divider 8 */
#define DIVS__1             (0x0000)    /* SMCLK Source Divider f(SMCLK)/1 */
#define DIVS__2             (0x0010)    /* SMCLK Source Divider f(SMCLK)/2 */
#define DIVS__4             (0x0020)    /* SMCLK Source Divider f(SMCLK)/4 */
#define DIVS__8             (0x0030)    /* SMCLK Source Divider f(SMCLK)/8 */
#define DIVS__16            (0x0040)    /* SMCLK Source Divider f(SMCLK)/16 */

/* CSIRFCAL Control Bits */
#define IRFCAL0              (0x0001)    /* DCO internal resistor frequency calibration value Bit 0 */
#define IRFCAL1              (0x0002)    /* DCO internal resistor frequency calibration value Bit 1 */
#define IRFCAL2              (0x0004)    /* DCO internal resistor frequency calibration value Bit 2 */
#define IRFCAL3              (0x0008)    /* DCO internal resistor frequency calibration value Bit 3 */
#define IRFCAL4              (0x0010)    /* DCO internal resistor frequency calibration value Bit 4 */
#define IRFCAL5              (0x0020)    /* DCO internal resistor frequency calibration value Bit 5 */
#define IRFCAL6              (0x0040)    /* DCO internal resistor frequency calibration value Bit 6 */
#define IRFCAL7              (0x0080)    /* DCO internal resistor frequency calibration value Bit 7 */

/* CSIRTCAL Control Bits */
#define IRTCAL0              (0x0001)    /* DCO internal resistor temperature calibration value Bit 0 */
#define IRTCAL1              (0x0002)    /* DCO internal resistor temperature calibration value Bit 1 */
#define IRTCAL2              (0x0004)    /* DCO internal resistor temperature calibration value Bit 2 */
#define IRTCAL3              (0x0008)    /* DCO internal resistor temperature calibration value Bit 3 */
#define IRTCAL4              (0x0010)    /* DCO internal resistor temperature calibration value Bit 4 */
#define IRTCAL5              (0x0020)    /* DCO internal resistor temperature calibration value Bit 5 */
#define IRTCAL6              (0x0040)    /* DCO internal resistor temperature calibration value Bit 6 */
#define IRTCAL7              (0x0080)    /* DCO internal resistor temperature calibration value Bit 7 */

/* CSERFCAL Control Bits */
#define ERFCAL0              (0x0001)    /* DCO external resistor frequency calibration value Bit 0 */
#define ERFCAL1              (0x0002)    /* DCO external resistor frequency calibration value Bit 1 */
#define ERFCAL2              (0x0004)    /* DCO external resistor frequency calibration value Bit 2 */
#define ERFCAL3              (0x0008)    /* DCO external resistor frequency calibration value Bit 3 */
#define ERFCAL4              (0x0010)    /* DCO external resistor frequency calibration value Bit 4 */
#define ERFCAL5              (0x0020)    /* DCO external resistor frequency calibration value Bit 5 */
#define ERFCAL6              (0x0040)    /* DCO external resistor frequency calibration value Bit 6 */
#define ERFCAL7              (0x0080)    /* DCO external resistor frequency calibration value Bit 7 */

/* CSERTCAL Control Bits */
#define ERTCAL0              (0x0001)    /* DCO external resistor temperature calibration value Bit 0 */
#define ERTCAL1              (0x0002)    /* DCO external resistor temperature calibration value Bit 1 */
#define ERTCAL2              (0x0004)    /* DCO external resistor temperature calibration value Bit 2 */
#define ERTCAL3              (0x0008)    /* DCO external resistor temperature calibration value Bit 3 */
#define ERTCAL4              (0x0010)    /* DCO external resistor temperature calibration value Bit 4 */
#define ERTCAL5              (0x0020)    /* DCO external resistor temperature calibration value Bit 5 */
#define ERTCAL6              (0x0040)    /* DCO external resistor temperature calibration value Bit 6 */
#define ERTCAL7              (0x0080)    /* DCO external resistor temperature calibration value Bit 7 */

